;; -*- no-byte-compile: t; -*-

;; $DOOMDIR/packages.el

;;; Utility
(package! s)
(package! f)
(package! rg)
(package! deadgrep)
(package! anzu)
(package! string-inflection)
(package! iedit)
(package! yasnippet)
(package! dired-narrow)
(package! undo-tree)
(package! visual-fill-column)

;;; Languages
(package! rust-mode)
(package! flymake-rust)
(package! flycheck-rust)
(package! cargo)
(package! racer)
(package! dockerfile-mode)
(package! fish-mode)
(package! nov)
(package! graphviz-dot-mode)
(package! haskell-mode)
(package! yaml-mode)
(package! ahk-mode)
(package! zig-mode)
(package! nim-mode)

;;; Notetaking
(package! doct)  ; org-capture, decleratively
(package! anki-editor)

;;; Themes
(package! apropospriate-theme)
(package! dracula-theme)
(package! kaolin-themes)

(package! org-roam-server)
(package! key-chord)
