;; -*- no-byte-compile: t; -*-
;; $DOOMDIR/packages.el

;;; Utility
(package! s)
(package! f)
(package! rg)
(package! deadgrep)
(package! anzu)
(package! string-inflection)
(package! iedit)
(package! yasnippet)
(package! dired-narrow)

;;; Languages
(package! rust-mode)
(package! flymake-rust)
(package! flycheck-rust)
(package! cargo)
(package! racer)
(package! dockerfile-mode)
(package! fish-mode)
(package! nov)
(package! graphviz-dot-mode)
(package! csharp-mode)
(package! fsharp-mode)

;;; Notetaking
;; (package! zetteldeft)
(package! org-roam-server)
(package! doct)  ; org-capture, decleratively
(package! anki-editor)

;;; Themes
(package! minimal-theme)
(package! tao-theme)
(package! apropospriate-theme)
(package! dracula-theme)
(package! flatland-theme)
(package! spacemacs-theme)
(package! color-theme-sanityinc-tomorrow)
(package! afternoon-theme)
(package! kaolin-themes)
(package! cyberpunk-theme)
