;; -*- no-byte-compile: t; -*-

;; $DOOMDIR/packages.el

;;; Utility
(package! s)
(package! f)
(package! rg)
(package! deadgrep)
(package! anzu)
(package! string-inflection)
(package! iedit)
(package! yasnippet)
(package! dired-narrow)
(package! undo-tree)
(package! visual-fill-column)

;;; Languages
(package! rust-mode)
(package! flymake-rust)
(package! flycheck-rust)
(package! rustic)
(package! cargo)
(package! racer)
(package! dockerfile-mode)
(package! nov)
(package! graphviz-dot-mode)
(package! ahk-mode)
(package! auctex)
(package! slime)
(package! elpy)

;;; Notetaking
(package! doct)  ; org-capture, decleratively
(package! anki-editor)
(package! org-sidebar)
(package! org-roam-bibtex)
(package! org-roam-server)

;;; Themes
(package! apropospriate-theme)
(package! dracula-theme)
(package! kaolin-themes)
(package! monokai-theme)
(package! material-theme)
(package! gruvbox-theme)

